
# coding: utf-8

# In[1]:

from repl import *


# In[2]:

headers='''
Host: browse.renren.com
Connection: keep-alive
Cache-Control: max-age=0
Upgrade-Insecure-Requests: 1
User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_11_5) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/52.0.2743.116 Safari/537.36
Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,*/*;q=0.8
Referer: http://www.renren.com/296695625/profile
Accept-Encoding: gzip, deflate, sdch
Accept-Language: zh-CN,zh;q=0.8,en;q=0.6
Cookie: anonymid=iqxs3arh-hus2ah; _r01_=1; XNESSESSIONID=ee0362aff077; l4pager=0; depovince=GW; jebecookies=c4bc4880-d117-40a7-94cc-3dd2d21391b4|||||; ick_login=c8df8dbb-c2ca-42a2-b20e-f2b27e06683d; jebe_key=b3f7048e-7d42-4f18-a23e-03d274b01a39%7Cd1c91d21c23af205fbde41b372732601%7C1469193870662%7C1%7C1470913691096; _de=B4F0273EEBE5D47A32E0B9ADC37B4602; p=106e8e0309b73b46a189dac5990846e02; first_login_flag=1; ln_uact=zym_by@126.com; ln_hurl=http://hdn.xnimg.cn/photos/hdn421/20120822/2245/h_main_1Hbx_528700010b791376.jpg; t=3b336ee1a515e4b6c3863e19f56b3bfb2; societyguester=3b336ee1a515e4b6c3863e19f56b3bfb2; id=230246512; xnsid=86b63f6a; ver=7.0; loginfrom=null; JSESSIONID=1D8D98426C02643F07F39F2B8D9B46B3; wp_fold=0
'''


# In[3]:

t=new_spider('list')


# In[4]:

t.requests.set_headers(headers)


# In[5]:

ct=new_spider('ct')
ct.requests.set_headers(headers)


# In[6]:

url='''http://browse.renren.com/sAjax.do?ajax=1&q=%20&p=%5B%7B%22t%22%3A%22birt%22%2C%22astr%22%3A%22%E6%91%A9%E7%BE%AF%22%7D%5D&s=0&u=230246512&act=search&offset=90&sort=0'''
  


# In[7]:

d=t.visit(url).great_hand(True).test().accept().get()


# In[8]:

format = '''http://browse.renren.com/sAjax.do?ajax=1&q=&p={0}&s=0&u=230246512&act=search&offset={1}&sort=0'''


# In[9]:

l=new_task('renrenlist')


# In[10]:

import urllib


# In[11]:

peo= new_spider('people')
peo.requests.set_headers(headers)


# In[12]:

peo.visit('http://www.renren.com/262894094/profile')


# In[13]:

peo.set_paras(False)


# In[14]:

peo.xpath('女生','gender').xpath('忻州市','home').xpath('西安市','now_live').xpath('10-18','birth')


# In[15]:

peo.accept().test().get()


# In[16]:

mongo =etl.MongoDBConnector();
mongo.connect_str='mongodb://10.101.167.107'
mongo.db='ant_temp'
con=new_connector('mongo',mongo)


# In[17]:

peo.visit('http://browse.renren.com/s/all?from=opensearch&q=#qt=/tindex=2').xpath('河北')


# In[18]:

province='北京 上海 天津 重庆 黑龙江 吉林 辽宁 山东 山西 陕西 河北 河南 湖北 湖南 海南 江苏 江西 广东 广西 云南 贵州 四川 内蒙古 宁夏 甘肃 青海 西藏 新疆 安徽 浙江 福建 台湾 香港 澳门'


# In[19]:

tp= province.split(' ')
query_format='[{"t":"birt","month":"{1}","year":"{0}","day":"{2}"},{"prov":"{3}","city":"{4}","t":"base"}]'


# In[20]:

cities='''var _city_1=["110101:东城区","110102:西城区","110103:崇文区","110104:宣武区","110105:朝阳区","110106:丰台区","110107:石景山区","110108:海淀区","110109:门头沟区","110111:房山区","110112:通州区","110113:顺义区","110114:昌平区","110115:大兴区","110116:怀柔区","110117:平谷区","110228:密云县","110229:延庆县"];
var _city_2=["310101:黄浦区","310103:卢湾区","310104:徐汇区","310105:长宁区","310106:静安区","310107:普陀区","310108:闸北区","310109:虹口区","310110:杨浦区","310112:闵行区","310113:宝山区","310114:嘉定区","310115:浦东新区","310116:金山区","310117:松江区","310118:青浦区","310119:南汇区","310120:奉贤区","310230:崇明县"];
var _city_3=["120101:和平区","120102:河东区","120103:河西区","120104:南开区","120105:河北区","120106:红桥区","120107:塘沽区","120108:汉沽区","120109:大港区","120110:东丽区","120111:西青区","120112:津南区","120113:北辰区","120114:武清区","120115:宝坻区","120221:宁河县","120223:静海县","120225:蓟县"];
var _city_4=["500101:万州区","500102:涪陵区","500103:渝中区","500104:大渡口区","500105:江北区","500106:沙坪坝区","500107:九龙坡区","500108:南岸区","500109:北碚区","500110:万盛区","500111:双桥区","500112:渝北区","500113:巴南区","500114:黔江区","500115:长寿区","500116:江津区","500117:合川区","500118:永川区","500119:南川区","500222:綦江县","500223:潼南县","500224:铜梁县","500225:大足县","500226:荣昌县","500227:璧山县","500228:梁平县","500229:城口县","500230:丰都县","500231:垫江县","500232:武隆县","500233:忠县","500234:开县","500235:云阳县","500236:奉节县","500237:巫山县","500238:巫溪县","500240:石柱土家族自治县","500241:秀山土家族苗族自治县","500242:酉阳土家族苗族自治县","500243:彭水苗族土家族自治县"];
var _city_5=["2301:哈尔滨市","2302:齐齐哈尔市","2303:鸡西市","2304:鹤岗市","2305:双鸭山市","2306:大庆市","2307:伊春市","2308:佳木斯市","2309:七台河市","2310:牡丹江市","2311:黑河市","2312:绥化市","2327:大兴安岭地区"];
var _city_6=["2201:长春市","2202:吉林市","2203:四平市","2204:辽源市","2205:通化市","2206:白山市","2207:松原市","2208:白城市","2224:延边朝鲜族自治州"];
var _city_7=["2101:沈阳市","2102:大连市","2103:鞍山市","2104:抚顺市","2105:本溪市","2106:丹东市","2107:锦州市","2108:营口市","2109:阜新市","2110:辽阳市","2111:盘锦市","2112:铁岭市","2113:朝阳市","2114:葫芦岛市"];
var _city_8=["3701:济南市","3702:青岛市","3703:淄博市","3704:枣庄市","3705:东营市","3706:烟台市","3707:潍坊市","3708:济宁市","3709:泰安市","3710:威海市","3711:日照市","3712:莱芜市","3713:临沂市","3714:德州市","3715:聊城市","3716:滨州市","3717:菏泽市"];
var _city_9=["1401:太原市","1402:大同市","1403:阳泉市","1404:长治市","1405:晋城市","1406:朔州市","1407:晋中市","1408:运城市","1409:忻州市","1410:临汾市","1411:吕梁市"];
var _city_10=["6101:西安市","6102:铜川市","6103:宝鸡市","6104:咸阳市","6105:渭南市","6106:延安市","6107:汉中市","6108:榆林市","6109:安康市","6110:商洛市"];
var _city_11=["1301:石家庄市","1302:唐山市","1303:秦皇岛市","1304:邯郸市","1305:邢台市","1306:保定市","1307:张家口市","1308:承德市","1309:沧州市","1310:廊坊市","1311:衡水市"];
var _city_12=["4101:郑州市","4102:开封市","4103:洛阳市","4104:平顶山市","4105:安阳市","4106:鹤壁市","4107:新乡市","4108:焦作市","4109:濮阳市","4110:许昌市","4111:漯河市","4112:三门峡市","4113:南阳市","4114:商丘市","4115:信阳市","4116:周口市","4117:驻马店市","4118:济源市"];
var _city_13=["4201:武汉市","4202:黄石市","4203:十堰市","4205:宜昌市","4206:襄樊市","4207:鄂州市","4208:荆门市","4209:孝感市","4210:荆州市","4211:黄冈市","4212:咸宁市","4213:随州市","4228:恩施土家族苗族自治州","429004:仙桃市","429005:潜江市","429006:天门市","429021:神农架林区"];
var _city_14=["4301:长沙市","4302:株洲市","4303:湘潭市","4304:衡阳市","4305:邵阳市","4306:岳阳市","4307:常德市","4308:张家界市","4309:益阳市","4310:郴州市","4311:永州市","4312:怀化市","4313:娄底市","4331:湘西土家族苗族自治州"];
var _city_15=["4601:海口市","4602:三亚市","469001:五指山市","469002:琼海市","469003:儋州市","469005:文昌市","469006:万宁市","469007:东方市","469025:定安县","469026:屯昌县","469027:澄迈县","469028:临高县","469030:白沙黎族自治县","469031:昌江黎族自治县","469033:乐东黎族自治县","469034:陵水黎族自治县","469035:保亭黎族苗族自治县","469036:琼中黎族苗族自治县"];
var _city_16=["3201:南京市","3202:无锡市","3203:徐州市","3204:常州市","3205:苏州市","3206:南通市","3207:连云港市","3208:淮安市","3209:盐城市","3210:扬州市","3211:镇江市","3212:泰州市","3213:宿迁市"];
var _city_17=["3601:南昌市","3602:景德镇市","3603:萍乡市","3604:九江市","3605:新余市","3606:鹰潭市","3607:赣州市","3608:吉安市","3609:宜春市","3610:抚州市","3611:上饶市"];
var _city_18=["4401:广州市","4402:韶关市","4403:深圳市","4404:珠海市","4405:汕头市","4406:佛山市","4407:江门市","4408:湛江市","4409:茂名市","4412:肇庆市","4413:惠州市","4414:梅州市","4415:汕尾市","4416:河源市","4417:阳江市","4418:清远市","4419:东莞市","4420:中山市","4451:潮州市","4452:揭阳市","4453:云浮市"];
var _city_19=["4501:南宁市","4502:柳州市","4503:桂林市","4504:梧州市","4505:北海市","4506:防城港市","4507:钦州市","4508:贵港市","4509:玉林市","4510:百色市","4511:贺州市","4512:河池市","4513:来宾市","4514:崇左市"];
var _city_20=["5301:昆明市","5303:曲靖市","5304:玉溪市","5305:保山市","5306:昭通市","5307:丽江市","5308:普洱市","5309:临沧市","5323:楚雄彝族自治州","5325:红河哈尼族彝族自治州","5326:文山壮族苗族自治州","5328:西双版纳傣族自治州","5329:大理白族自治州","5331:德宏傣族景颇族自治州","5333:怒江傈僳族自治州","5334:迪庆藏族自治州"];
var _city_21=["5201:贵阳市","5202:六盘水市","5203:遵义市","5204:安顺市","5222:铜仁地区","5223:黔西南布依族苗族自治州","5224:毕节地区","5226:黔东南苗族侗族自治州","5227:黔南布依族苗族自治州"];
var _city_22=["5101:成都市","5103:自贡市","5104:攀枝花市","5105:泸州市","5106:德阳市","5107:绵阳市","5108:广元市","5109:遂宁市","5110:内江市","5111:乐山市","5113:南充市","5114:眉山市","5115:宜宾市","5116:广安市","5117:达州市","5118:雅安市","5119:巴中市","5120:资阳市","5132:阿坝藏族羌族自治州","5133:甘孜藏族自治州","5134:凉山彝族自治州"];
var _city_23=["1501:呼和浩特市","1502:包头市","1503:乌海市","1504:赤峰市","1505:通辽市","1506:鄂尔多斯市","1507:呼伦贝尔市","1508:巴彦淖尔市","1509:乌兰察布市","1522:兴安盟","1525:锡林郭勒盟","1529:阿拉善盟"];
var _city_24=["6401:银川市","6402:石嘴山市","6403:吴忠市","6404:固原市","6405:中卫市"];
var _city_25=["6201:兰州市","6202:嘉峪关市","6203:金昌市","6204:白银市","6205:天水市","6206:武威市","6207:张掖市","6208:平凉市","6209:酒泉市","6210:庆阳市","6211:定西市","6212:陇南市","6229:临夏回族自治州","6230:甘南藏族自治州"];
var _city_26=["6301:西宁市","6321:海东地区","6322:海北藏族自治州","6323:黄南藏族自治州","6325:海南藏族自治州","6326:果洛藏族自治州","6327:玉树藏族自治州","6328:海西蒙古族藏族自治州"];
var _city_27=["5401:拉萨市","5421:昌都地区","5422:山南地区","5423:日喀则地区","5424:那曲地区","5425:阿里地区","5426:林芝地区"];
var _city_28=["6501:乌鲁木齐市","6502:克拉玛依市","6521:吐鲁番地区","6522:哈密地区","6523:昌吉回族自治州","6527:博尔塔拉蒙古自治州","6528:巴音郭楞蒙古自治州","6529:阿克苏地区","6530:克孜勒苏柯尔克孜自治州","6531:喀什地区","6532:和田地区","6540:伊犁哈萨克自治州","6542:塔城地区","6543:阿勒泰地区","659001:石河子市","659002:阿拉尔市","659003:图木舒克市","659004:五家渠市"];
var _city_29=["3401:合肥市","3402:芜湖市","3403:蚌埠市","3404:淮南市","3405:马鞍山市","3406:淮北市","3407:铜陵市","3408:安庆市","3410:黄山市","3411:滁州市","3412:阜阳市","3413:宿州市","3414:巢湖市","3415:六安市","3416:亳州市","3417:池州市","3418:宣城市"];
var _city_30=["3301:杭州市","3302:宁波市","3303:温州市","3304:嘉兴市","3305:湖州市","3306:绍兴市","3307:金华市","3308:衢州市","3309:舟山市","3310:台州市","3311:丽水市"];
var _city_31=["3501:福州市","3502:厦门市","3503:莆田市","3504:三明市","3505:泉州市","3506:漳州市","3507:南平市","3508:龙岩市","3509:宁德市"];
var _city_32=["7101:台北市","7102:高雄市","7103:基隆市","7104:台中市","7105:台南市","7106:新竹市","7107:嘉义市"];
var _city_33=["8101:中西区","8102:湾仔区","8103:东区","8104:南区","8105:油尖旺区","8106:深水埗区","8107:九龙城区","8108:黄大仙区","8109:观塘区","8110:荃湾区","8111:葵青区","8112:沙田区","8113:西贡区","8114:大埔区","8115:北区","8116:元朗区","8117:屯门区","8118:离岛区"];'''


# In[21]:

p=0;
pro_cities={}
for r in cities.split('\n'):
    ss=r.split('[')
    pro=tp[p]
    buf=[]
    city= ss[1].split(']')[0]
    city= city.replace('"','')
    for c in city.split(','):
        cc= c.split(':')
        buf.append(cc[1])
    pro_cities[pro]=buf
    p+=1


# In[22]:

def pro_cities_generator():
    for p,c in pro_cities.items():
        for s in c:
            yield {'city':s,'pro':p}


# In[23]:

b=new_task('birth')


# In[37]:

b.clear();
b.pyge(script=pro_cities_generator)
b.rangege('year',max=2005,min=1980,mode=etl.MERGE_TYPE_CROSS)
b.rangege('month',max=13,min=1,mode=etl.MERGE_TYPE_CROSS)
b.rangege('day',max=32,min=1,mode=etl.MERGE_TYPE_CROSS)
b.merge({'year':'query'},script=query_format,merge_with='month day pro city')
b.delete(['city','day','pro','year','month'])
b.get()


# In[45]:

l.clear()
l.etlge(selector='birth')
l.py({'query':'js'}, script=lambda x:urllib.request.quote(str(x['query'])))
l.merge({'js':'url'},script=format,merge_with='0')
l.tolist(count_per_thread=10)
l.crawler('url',selector='ct')
l.xpath('Content',mode=etl.GET_HTML, xpath='//*[@id="resultNum"]')
l.number('Content')
l.rangege('p',max='[Content]',mode=etl.MERGE_TYPE_CROSS,interval=10)

l.merge({'js':'url'}, script=format, merge_with='p')
l.crawler('url',selector='list',new_col='query')
l.json('col5_popval',mode=etl.GENERATE_DOC)
l.number({'col7':'common_friends'})
l.number({'col1_href':'id'},index=1)
l.delete(['col1_href','col3_href','col5_popval','col7','col9_data-id','col10_data.name','col8_data-common'])
l.number('user_lively')
l.rename({'col6':'expr','col0_data-src':'head','col2':'name'})
# l.merge({'id':'url'},script='http://www.renren.com/{0}/profile')
# l.crawler('url',selector='people')
# l.replace('home',script='来自')
# l.replace('now_live',script='现居')
l.replace('expr',script='经历 : ')
l.dbex('id',connector='mongo',table='renren')
# l.delete('url')


# In[46]:

l.get(etl_count=20)


# In[40]:

#%mkdir ../Hawk-Projects/人人网


# In[41]:

#proj.dump_json('../Hawk-Projects/人人网/列表.json')


# In[42]:

l.distribute()


# In[43]:

l.stop_server()


# In[ ]:




# In[ ]:



